#include "time_utils.h"
#include "pico/stdlib.h" // 🌟 必须显式引入 Pico 原生 SDK 库

// ---------------------------------------------------------
// 强行接管延时函数，彻底抛弃 Arduino 的 delay()
// ---------------------------------------------------------
void _delay(unsigned long ms) {
    // 直接调用 Pico SDK 原生的非阻塞毫秒延时
    sleep_ms(ms);
}

// ---------------------------------------------------------
// 强行接管时间戳函数，彻底消灭时间冻结！
// ---------------------------------------------------------
unsigned long _micros() {
    // 暴力读取 RP2350 底层的 32位 硬件定时器
    // 它的返回值类型 uint32_t 与 unsigned long 完美匹配，绝对精准
    return time_us_32();
}